app/views/teams/show.html.erb

  <tbody>
  <% @team.players.each do |p| %>
---
SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 1]]