app/views/games/_form.html.erb

      <%= f.label :team1_id %>
      <%= f.collection_select :team1_id, Team.order(:name), :id, :name %>
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC