app/views/games/show.html.erb

SELECT  "players".* FROM "players" INNER JOIN "map_player_stats" ON "players"."id" = "map_player_stats"."player_id" WHERE "map_player_stats"."game_id" = ? ORDER BY "players"."id" ASC LIMIT ?  [["game_id", 1], ["LIMIT", 1]]
---
      <tr>
        <td><%= link_to("#{p.player.first_name} #{p.last_name}", player_path(p.id)) %></td>