app/views/players/_form.html.erb

    <%= f.label :team_id %>
    <%= f.collection_select :team_id, Team.order(:name), :id, :name %>
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC