app/controllers/games_controller.rb

INSERT INTO "games" ("name", "date", "team1_id", "team2_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Game 5"], ["date", ""], ["team1_id", 6], ["team2_id", 5], ["created_at", 2016-12-02 21:48:01 UTC], ["updated_at", 2016-12-02 21:48:01 UTC]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

UPDATE "games" SET "name" = ?, "team1_id" = ?, "team2_id" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["name", "Game 2"], ["team1_id", 3], ["team2_id", 2], ["updated_at", 2016-12-07 03:05:57 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @game.update(game_params)