app/controllers/players_controller.rb

INSERT INTO "players" ("first_name", "last_name", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Devin "], ["last_name", "Hoole"], ["team_id", 1], ["created_at", 2016-11-19 04:48:23 UTC], ["updated_at", 2016-11-19 04:48:23 UTC]]
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save

UPDATE "players" SET "team_id" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["team_id", 4], ["updated_at", 2016-11-22 03:20:50 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @player.update(player_params)